In [1]:
import numpy as np
import pandas as pd

In [4]:
sal = pd.read_csv('C:\\Chandu\\Python\\Refactored_Py_DS_ML_Bootcamp-master\\04-Pandas-Exercises\\Salaries.csv')
sal.head(3)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN

In [11]:
y = [1,2,3]
z = lambda y:y**2
list(map(z, y))

[1, 4, 9]

In [17]:
x = ['abc','bc','c','b','B']
g = lambda y:'b' in y.lower()
list(map(g,x))

[True, True, False, True, True]

In [21]:
sum(sal['JobTitle'].apply(lambda y:'chief' in y.lower()))

627

In [24]:
sum(sal['JobTitle'].apply(lambda y:'Chief' in y))

423

In [31]:
sal['LenJobTitle']=sal['JobTitle'].apply(len)
sal[['LenJobTitle','TotalPay']].corr()

             LenJobTitle  TotalPay
LenJobTitle     1.000000 -0.015356
TotalPay       -0.015356  1.000000

In [12]:
my_text = ['''Row((u'jjt-consumerdatalake-bigquery', u'136654106', u'ga_sessions_20180308', 1107998), {u'project_id': 0, u'dataset_id': 1, u'table_id': 2, u'size_bytes': 3})''']
df = pd.DataFrame(my_text)
df
df2 = pd.DataFrame(list(df[0].apply(lambda x:x.split(','))))
df2
#df2[0] = df2[0].apply(lambda x: x.lstrip('Row((u'))
#df2

,0,1,2,3,4,5,6,7
0,Row((u'jjt-consumerdatalake-bigquery',u'136654106',u'ga_sessions_20180308',1107998),{u'project_id': 0,u'dataset_id': 1,u'table_id': 2,u'size_bytes': 3})

In [25]:
df_23 = pd.read_csv('data_test.csv', header=None)
df_23.head()

df_23 = pd.DataFrame(list(df_23[0].apply(lambda x:x.split(','))))
df_23[0] = df_23[0].apply(lambda x: x.lstrip('Row((u'))
#df_23.head()

df_23.drop([4,5,6],axis=1,inplace=True)

In [27]:
df_23.drop([7],axis=1,inplace=True)

In [43]:
df_23[3] = df_23[3].apply(lambda x:x.replace(')',''))
df_23.to_csv('data_test_final.csv',header=False,index=False)